{
  "sidebar": {
    "title": "Web Developer",
    "whoami": "whoami",
    "portfolio": "portfolio",
    "skills": "skills",
    "contact": "contact"
  },
  "whoami": "Clark\nA Fullstack Developer\npassionate about React and Kotlin",
  "portfolio": {
    "title": "web developer portfolio"
  },
  "skills": {
    "title": "Coding and Me",
    "content": "My love for programming and web app development started out as a strong interest in computer science and the internet. By learning to program, I found it very rewarding to create something from nothing. Also, it is one of my great interests to keep learning and exploring new technologies. I like to learn about the latest technology and development trends and try to apply them to my projects. I also love finding and sharing knowledge about technology on development platforms like Stack Overflow, Github, etc. I hope to become a full-stack developer and provide users with excellent web applications while constantly learning and exploring innovative technologies."
  },
  "contact": {
    "title": "Contact Me",
    "form": {
      "user": "User",
      "email": "Email",
      "subject": "Subject",
      "message": "Message",
      "submit": "Submit"
    }
  },
  "modal": {
    "gotoapp": "Go To APP",
    "gotogithub": "Go To Github",
    "portfolio": "This is a Next.js project built with TypeScript for static type checking. Storybook is integrated for developing UI components in isolation. The backend REST APIs are designed using Swagger/OpenAPI specifications for clear documentation. Responsive design is implemented using a global CSS file and the react-responsive library to adjust styling based on screen size.State management is handled using a combination of Zustand for global state, useContext for sharing data between components, and useState for local component state. Theming is enabled through CSS variables that are controlled via the global state. Users can toggle between light and dark themes. UI imitate from the jacekjeznach's.",
    "imageplus": ""
  }
}
