{
  "sidebar": {
    "title": "Web開発者",
    "whoami": "自己紹介",
    "portfolio": "ポートフォリオ",
    "skills": "スキル",
    "contact": "お問い合わせ"
  },
  "whoami": "Clark\nReactと Kotlinに\n情熱を持つフルスタック開発者",
  "portfolio": {
    "title": "Web開発者のポートフォリオ"
  },
  "skills": {
    "title": "コーディングと私",
    "content": "コンピュータサイエンスとインターネットに対する強い興味から、プログラミングとWebアプリケーション開発に対する情熱が自然と湧いてきました。chatgpt、midjourneyなどのAIは、アプリケーション開発に大きな便利さをもたらすとともに、私の仕事に無限のインスピレーションを提供してくれます。これらの強力な新しいツールを使えば、アイデアをよりスピーディに現実のものにすることができます。ゼロからsomethingを作り上げ、最終的にそれを実現する過程は大変な達成感があります。概念を実際の作品に変換していくプロセス全体を楽しんでいます。最新・最先端の技術と業界のトレンドを学ぶことに熱中しているとともに、積極的にプロジェクトでそれらを応用しています。これは私の技術スタックを豊かにするだけでなく、作品が時代の最先端を行くことができるようにしてくれます。私の最終目標は、全てのWebアプリケーションを一貫して構築できる一流のフルスタック開発者になることです。シンプルで洗練されたインタフェースと卓越したユーザーエクスペリエンスを備えた製品を作り出し、人々の実際のニーズを満たしたいと考えています。そのためには自分自身の絶え間ない努力と幅広い経験の蓄積が必要不可欠です"
  },
  "contact": {
    "title": "お問い合わせ",
    "form": {
      "user": "ユーザー名",
      "email": "メールアドレス",
      "subject": "件名",
      "message": "メッセージ",
      "submit": "送信"
    }
  },
  "modal": {
    "gotoapp": "アプリに移動",
    "gotogithub": "Github",
    "portfolio": "これは、静的型チェックのためにTypeScriptで構築されたNext.jsプロジェクトです。 Storybookは、UIコンポーネントを独立して開発するために統合されています。バックエンドのREST APIは、明確なドキュメントのためにSwagger / OpenAPI仕様で設計されています。グローバルなCSSファイルとreact-responsiveライブラリを使用して、画面サイズに基づいてスタイリングを調整することにより、レスポンシブデザインが実装されています。状態管理は、グローバル状態のZustand、コンポーネント間でデータを共有するuseContext、およびローカルコンポーネント状態のuseStateの組み合わせで処理されます。テーマは、グローバル状態を介して制御されるCSS変数を介して有効になります。ユーザーはライトとダークのテーマを切り替えることができます。",
    "imageplus": "これは、Kotlin Spring WebfluxのリアクティブバックエンドとTypeScriptで記述されたVite Reactフロントエンドを備えた現代的なWebアプリケーションです。バックエンドでは、非ブロッキングリクエストのためにSpring Webflux REST APIを使用し、Kotlinを利用して簡潔なコードを実現しています。認証にはJWTとOAuth2を使用しています。ページ/データ/APIへのアクセス制御のために、フロントエンドとバックエンドの両方でRBACを実施しています。Reactフロントエンドはフックを持つ関数コンポーネントを使 用し、Zustandでグローバル状態、useContextとuseStateの組み合わせでローカル状態を管理しています。CSSとreact-responsiveでレスポンシブデザインを実装。グローバルCSS変数でUIテーマを制御できます。StorybookでUIコンポーネントの開発を行えます。React Routerでページベースのナビゲーションシステムを提供しています。データ保存では、PostgreSQLリレーショナルデータベースにユーザーデータを保存しています。ユーザーアップロード画像はAWS S3に保存され、ファイルメタデータはドキュメントとして、いいねデータはSurrealDBのデータベースのグラフDBでそれぞれ保存されます。その他、React i18nで多言語化を実装しています。サーバーセントイベントでリアルタイムにいいねを更新しています。Unsplashライクの瀑布流レイアウトも実装されています。"
  }
}
